app/Http/Controllers/NotificationsController.php

select * from `notifications` where `achiever` = 2 limit 10 offset 0
select count(*) as aggregate from `notifications` where `achiever` = 2
update `users` set `notification_count` = 0, `updated_at` = '2019-05-05 14:42:34' where `id` = 2
---
    public function index()
    {
        // 获取登录用户的所有通知
        $notifications = Notification::where('achiever', Auth::id())->paginate(10);
        // var_dump($notifications);
        // 标记为已读，未读数量清零
        $update = User::find(Auth::id());
        $update->notification_count = 0;
        $update->save();

select `name` from `users` where `id` = 2 limit 1
select * from `replies` where `sender_id` = '111111111@qq.com' limit 10 offset 0
select count(*) as aggregate from `replies` where `sender_id` = '111111111@qq.com'
---
    public function watch()
    {
        // 获取登录用户所有发起的审核
        $user_name = User::where('id', Auth::id())->value('name');
        $replies = Reply::where('sender_id', $user_name)->paginate(10);

select `reply_id` from `notifications` where `id` = 40 limit 1
select * from `replies` where `id` = 94
---
    public function check(Request $request, User $user)
    {
        //通过消息获取回复的Id
        //获取数组下标，传入的值迷之变成下标，所以这么解决了
        $this->authorize('check',$user);
        $notice = array_keys($request->all());
        $notice_id = $notice[0];
        $reply_id = Notification::where('id', $notice_id)->value('reply_id');

        $reply = Reply::where('id' , $reply_id)->get();

select `reply_id` from `notifications` where `id` = 42 limit 1
select * from `replies` where `id` = 94
---
    public function resultofnotice(Request $request)
    {
        //通过消息获取回复的Id
        //获取数组下标，传入的值迷之变成下标，所以这么解决了
        $notice = array_keys($request->all());
        $notice_id = $notice[0];
        $reply_id = Notification::where('id', $notice_id)->value('reply_id');

        $reply = Reply::where('id' , $reply_id)->get();