app/Http/Controllers/RepliesController.php

select `notification_count` from `users` where `id` = '1' limit 1
---
	public function store(ReplyRequest $request, Reply $reply, User $user)
	{
		$today = date('Y-m-d');
		$id = $request->user_id;

		$reply->content = $request->content;
		$reply->antopic_id = $request->antopic_id;
        $reply->user_id = $request->user_id;
        $reply->save();

        $notice = Notifications::create([
            'name' => $request->name,
            'sender' => Auth::id(),
            'achiever' => $request->user_id,
            'content' => $request->content,
            'kind' => $request->category_id,
            'datetime' => $today
        ]);

        $count = User::where('id', $id)->value('notification_count')+1;