app/Http/Controllers/RepliesController.php

select * from `admins` where `department` = 'Human Resources'
---
            }
            if($user_access == 0)
            {
                $admin_list = Admin::where('department', $user_department)->get();