app/Http/Controllers/RepliesController.php

select `id` from `users` where `name` = '376300797@qq.com' limit 1
select `id` from `users` where `name` = '1' limit 1
---
	public function store(Request $request, Reply $reply, User $user)
	{
        //获取日期
		$today = date('Y-m-d');
        //获取提交者的用户Id
		$username = $request->user_name;
        $user_id = User::where('name', $username)->value('id');
        $sender_name =  User::where('id', Auth::id())->value('name');

select `is_admin` from `users` where `id` = 2 limit 1
select `department` from `users` where `id` = 2 limit 1
---
                return view('users.apply', compact('user'));
            }

            $user_access = User::where('id', Auth::id())->value('is_admin');
            $user_department = User::where('id', Auth::id())->value('department');

select `is_admin` from `users` where `id` = '1' limit 1
---
            //如果权限是普通用户，则只允许给管理员级别的用户发送申请。
            if($user_access == 0 )
            {
                $tag = User::where('id', $user_id)->value('is_admin');

select `department` from `users` where `id` = '1' limit 1
---
                }
                else
                {
                    $tag_department = User::where('id', $user_id)->value('department');

insert into `replies` (`content`, `title`, `user_id`, `sender_id`, `kind`, `admin_reply`, `filename`, `route`, `updated_at`, `created_at`) values ('345345345', '又来一发测试', '1', 6, '物资申请', '', '2019-05-01-03-18-12.png', 'uploads/2019-05-01/2019-05-01-03-18-12.png', '2019-05-01 15:18:12', '2019-05-01 15:18:12')
---
                            $reply->filename = $filename;
                            $reply->route = 'uploads/'.$today.'/'.$filename;
                            $reply->admin_reply = $request->adminreply;
                            $reply->save();

select `id` from `replies` where (`user_id` = 1 and `title` = '用例测试' and `content` = '这是测试环境') limit 1
---
                            return view('users.apply', compact('user'));
                        }
                        //获取保存记录的id
                        $reply_id = Reply::where(['user_id' => $user_id, 'title' => $request->title, 'content' => $request->content])->value('id');

select `notification_count` from `users` where `id` = 1 limit 1
update `users` set `notification_count` = 1, `updated_at` = '2019-05-05 13:00:18' where `id` = 1
---
                            'datetime' => $today
                        ]);
                        //用户的消息记录+1
                        $count = User::where('id', $user_id)->value('notification_count')+1;
                        $update = User::find($user_id);
                        $update->notification_count = $count;
                        $update->save();

select `id` from `notifications` where `reply_id` = '89' limit 1
delete from `notifications` where `id` = 27
select `user_id` from `replies` where `id` = '89' limit 1
select `notification_count` from `users` where `id` = 1 limit 1
---
	public function destroy(Request $request)
	{
        //这次通过url来获取id
        $url = $request->url();
        $array=explode('/', $url);
        //url固定规律获取最后/后的id
        $reply_id = $array[4];
        $notice_id = Notification::where('reply_id', $reply_id)->value('id');
        if(Notification::find($notice_id)->delete())
        {
            //通过reply表来获取发送对象的id
            $tag_id = Reply::where('id', $reply_id)->value('user_id');
            $count_res = User::where('id', $tag_id)->value('notification_count');