app/Http/Controllers/TopicsController.php

	public function create(Request $request, Topic $topic, User $user)
	{
		$admin = $request->input('is_admin');
		if($admin == 1){
			$this->authorize('create', $user);
			$categories = Category::all();
---
select * from `categories`

	public function store(TopicRequest $request, Topic $topic)
    {
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        $topic->save();
---
insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('156332', '3', '123456', 1, '123456', '2019-04-14 19:08:03', '2019-04-14 19:08:03')