app/Http/Controllers/UsersController.php

update `users` set `email` = '376300797@qq.com', `password` = 'y$RpoqTZQGxZRIVvNJwBylY.hHvZylk3L9SwcIuNo6yTkWesu62c/Du', `updated_at` = '2019-05-02 17:34:21' where `id` = 1
---
	public function update(User $user, Request $request)
	{
		$check = $request->is_check;
		var_dump($check);
		if($check == 1)
		{
			$this->authorize('update',$user);
			$this->validate($request,[
				'name' => 'required|max:80',
				'password' => 'nullable|confirmed|min:6',
				'tel' => 'required|min:11'
			]);

			$data = [];
	        $data['name'] = $request->name;
	        $data['tel'] = $request->tel;
	        if ($request->password) {
	            $data['password'] = bcrypt($request->password);
	        }
	        $user->update($data);