app/Http/Controllers/UsersController.php

	public function apply(User $user)
    {
    	$this->authorize('update', $user);
    	$is_admin = $user->is_admin;
    	if($is_admin == 1)
    	{
    		$admin_list = Admin::all();
    	}
    	if($is_admin == 0)
    	{
    		$department = $user->department;
    		$admin_list = Admin::where('department', $department)->get();
---
select * from `admins` where `department` = 'Human Resources'

	public function update(User $user, UserRequest $request, ImageUploadHandler $uploader)
	{
		$check = $request->is_check;
		if($check == 1)
		{
			$this->authorize('update',$user);
			$data = [];
			//执行头像数据上传
	        if ($request->avatar) {
	            $result = $uploader->saveimage($request->avatar, 'avatars', $user->id);
---
update `users` set `arrangement` = '你要记得的事ewrwer wer ewr', `updated_at` = '2019-05-02 20:00:15' where `id` = 1

	        if ($request->password) {
	            $data['password'] = bcrypt($request->password);
	        }
	        $user->update($data);
---
update `users` set `position` = 'Human Test', `tel` = '12345678901', `updated_at` = '2019-05-14 21:06:47' where `id` = 2